Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཁོར་གཅིག་ལ་གཅིག་མངོན་པར་དགའ་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of the retinue in which there is fondness for one another.

source: འཁོར་མ་བཏང་བར་རང་གི་བྱ་བ་རྣམས་ལ་བརྩོན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of endeavoring in one’s own work while not letting go of the retinue.

source: ལེགས་པར་བསམ་པ་སེམས་ཤིང་འཁོར་དུལ་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of keeping a wholesome intent and taming the retinue.

source: འཁོར་ཐམས་ཅད་ཀྱི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of the entire retinue.

source: འདི་དག་ནི་རིགས་ཕུན་སུམ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of a perfect family.

source: དེ་ལ་འཁོར་ཕུན་སུམ་ཚོགས་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections conducive to a perfect retinue?

source: འདུས་པ་ཆེན་པོ་དག་ལ་ལོ་ལྔའི་བར་དུ་ཡང་དག་པར་ལེན་དུ་འཇུག་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the generosity that is adopted for five years within the great assembly.

source: སྐྱེ་བོ་མང་པོའི་འབྱོར་པ་སྐྱོ་བ་མེད་པའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་ཀུན་ཏུ་རྒྱུ་རྟོགས་བྱེད་ཀྱི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of providing for many beings, as exemplified by the wandering mendicant Realizer.

source: སེམས་ཅན་མང་པོའི་ཕྱིར་བཟོད་པ་ནི་དཔེར་ན་ནོར་ལྔ་བྲེ་གང་གི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོར་ཆུ་སྲིན་མ་ཀ་རའི་ཁར་ཞུགས་པ་དང་། ཡང་དཔེར་ན་ནོར་ལྔ་བྲེ་གང་གི་ཕྱིར་ཁྲོན་པར་སོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is patience practiced for the sake of many beings, as shown by the example of entering a makara sea monster’s mouth for the sake of five measures of wealth, or entering a well for the sake of five measures of wealth.

source: སྐྱེ་བོ་མང་པོ་ལ་བསྐྱབ་པའི་ཕྱིར་བརྩོན་པ་ནི་དཔེར་ན་ནོར་བུའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོ་བསྐམ་པར་བརྩམས་པ་གང་ཡིན་པ་དེ་ལྟ་བུ་སྟེ། དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is to endeavor to save many beings, as exemplified by the endeavor to dry up the sea for the sake of jewels.

source: མུ་སྟེགས་བྱེད་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་བསམ་གཏན་སེམས་ཅན་རྣམས་ལ་ཕན་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration for the benefit of sentient beings, as in the case of the non-Buddhist Araṇemi.

source: སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་བརྩོན་པའི་ཤེས་རབ་ནི་དཔེར་ན་རི་དགས་ཀྱི་རྒྱལ་པོ་བློ་བཟངས་ཀྱིས་རི་དགས་ལྔ་བརྒྱ་རྒྱར་ཆུད་པ་རྣམས་གཞན་རི་བོང་དང་ལྷན་ཅིག་ཏུ་ཐར་བར་བྱས་ནས་འབྲོས་སུ་བཏང་བ་དང་། འཛམ་བུའི་གླིང་པའི་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ལ་བཀོད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight for the sake of benefiting many beings, as exemplified by the king of deer, Subuddhi, who, along with a hare, freed and released five hundred deer who were caught in snares, and who established all beings of Jambudvīpa upon the path of the ten virtuous actions.

source: འདི་དག་ནི་འཁོར་ཕུན་སུམ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections conducive to a perfect retinue.

source: དེ་ལ་འཁོར་མི་ཕྱེད་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections conducive to an undivided retinue?

source: ཕྲ་མའི་ཚིག་སྤངས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving free from divisive talk.

source: བྱམས་པ་ལ་དམིགས་པའི་ཐོགས་པ་མེད་པའི་སེམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་གོ་བགོས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is to don the armor of the discipline of an unimpeded mind focused on love.

source: སེམས་མཉམ་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of the mind of equality.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཟང་ཟིང་མེད་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence that is free from materialistic concerns and undertaken for the sake of ripening sentient beings.

source: གཟུངས་རབ་ཏུ་ཐོབ་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of attaining retention.

source: རྣམ་པར་གྲོལ་བས་ཡོངས་སུ་བཟུང་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight embraced by liberation.

source: འདི་དག་ནི་འཁོར་མི་ཕྱེད་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections conducive to an undivided retinue.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་དག་པ་བསྐྱེད་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that give rise to pure ripening?

source: ནད་པ་མགོན་མེད་པ་རྣམས་ལ་གསོས་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is to give healing to the sick and unprotected.

source: སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་པ་རྣམས་ཡོངས་སུ་སྐྱོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is to save those tormented by suffering.

source: བླ་མས་སྤྱོས་པ་བཟོད་ཅིང་མི་ཁྲོ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is to accept the rebuke of gurus without developing anger.

source: མངལ་ན་ཀུན་ཏུ་རྨོངས་པ་གསོ་བར་བྱེད་པ་དང་། བསྟན་པ་ལས་མངོན་པར་འཕགས་པ་རྣམས་ལ་སྟོན་པ་དང་། དགེ་སློང་མ་རྣམས་ལ་རྗེས་སུ་བསྲུང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence in curing dullness within the womb, demonstrating the teaching to noble beings, and protecting nuns.

source: གཞན་ལ་ཕན་པའི་ཕྱིར་མ་ལ་བསྙེན་བཀུར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is to venerate the mother for the benefit of others.

source: སྐྱེ་བོ་མང་པོའི་འགྱོད་པ་སེལ་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that dispels the regrets of many people.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་དག་པ་བསྐྱེད་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that give rise to pure ripening.

source: དེ་ལ་ཕྱོགས་རྣམ་པར་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of seeing in all directions?

source: ཐོགས་པ་མེད་པར་མིག་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is the unhindered giving of one’s eyes.

source: སྒྲིབ་པ་མེད་པའི་སེམས་ཀྱི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline free from obscuration.

source: བསམ་པ་ངེས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of noble thought.

source: སྐྱོ་བ་མེད་པའི་མངོན་པར་ཤེས་པ་མ་བསྒྲུབས་པ་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is untiring diligence in achieving superknowledges that one did not previously possess.

source: ལྷའི་མིག་གི་ཕྱིར་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is training in concentration for the sake of the divine eye.

source: སྒྲ་དང་བརྡ་རབ་ཏུ་རྟོགས་པར་བྱེད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of understanding languages and signs.

source: འདི་དག་ནི་ཕྱོགས་རྣམ་པར་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of seeing in all directions.

source: དེ་ལ་ཡོངས་སུ་ཤེས་པ་སྒྲོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the proclamation of knowledge?

source: སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་བསྔོས་ཤིང་། གཞན་ལ་ཕན་པའི་རྣམ་པར་སྨིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity of which the ripening is dedicated to sentient beings and their benefit.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དང་བྲལ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline free from the connectivity of karmic imprints.

source: སྙིང་རྗེ་མེད་པ་མ་ཡིན་པ་ལས་ངེས་པར་བྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of deliverance that does not lack compassion.

source: ཟིལ་གྱིས་ནོན་པ་མེད་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence that cannot be subdued.

source: ཚད་མེད་པས་ཡོངས་སུ་བཟུང་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is concentration embraced by the immeasurable qualities.

source: ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight that accords with discernment.

source: འདི་དག་ནི་ཡོངས་སུ་ཤེས་པ་སྒྲོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the proclamation of knowledge.

source: དེ་ལ་བག་ཡོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of carefulness?

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་ནི་དཔེར་ན་བློན་པོ་ས་གའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity dedicated to awakening, as exemplified by the minister Saga.

source: གནད་བཅད་པ་ལ་གནས་ཀྱང་ལས་ལ་རྟོན་པའི་ཚུལ་ཁྲིམས་ནི་དཔེར་ན་རྔོན་པ་དཔའ་རྟོགས་ཀྱིས་སེང་གེའི་གནད་དུ་བསྣུན་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of relying on action even when mortally wounded, as exemplified by the lion that had been fatally wounded by the hunter Bold Understanding.

source: ལེགས་པར་གསུངས་པའི་དོན་དུ་མེའི་ཕུང་པོར་མཆོང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the acceptance to jump into a bonfire for the sake of the well-spoken teachings.

source: འདུས་བྱས་ལ་འབར་བར་མཐོང་ཞིང་མྱ་ངན་ལས་འདས་པའི་བསམ་པ་ཅན་གྱི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of regarding conditioned phenomena as a blaze and having an intention set on nirvāṇa.

source: རྒྱལ་སྲིད་ཐམས་ཅད་སྤངས་ཏེ་གཅིག་པུར་རི་ལ་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པར་གནས་ཤིང་གྲགས་པ་དང་འཁོར་མང་པོར་ལྡན་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration that achieves fame and a retinue once one has relinquished one’s royal realm and gone to live alone in the mountains free from defilements.

source: རོ་མྱང་བ་མེད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་མཉམ་སེམས་ཀྱིས་རྒྱལ་སྲིད་བཏང་ནས་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ཇི་སྙེད་པ་དག་གང་ཡིན་སྙམ་ནས་དྲི་མ་དང་བྲལ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight free from relishing, as exemplified by the prince Even Mind who gave up his realm and then asked himself, ‘What is the full set of actions free from unwholesomeness?’ and thereupon became free from stains.

source: འདི་དག་ནི་བག་ཡོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of carefulness.

source: དེ་ལ་རྫི་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of being unharmed?

source: ལེན་པ་མང་པོ་རྣམས་ལ་ཐོགས་པ་མེད་པའི་སེམས་ཀྱིས་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is unhindered giving to numerous recipients.

source: གཡོ་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline free from conceit.

source: བསྒོམས་པ་ལས་ངེས་པར་བྱུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of deliverance arising from meditation.

source: ཆོས་མཉམ་པ་ཉིད་ལ་གནས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of abiding by the equality of all phenomena.

source: ཕྱིར་མི་ལྡོག་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is irreversible concentration.

source: ཆོས་ཐམས་ཅད་རྣམ་པར་འཇོག་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of resting in all phenomena.

source: འདི་དག་ནི་རྫི་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of being unharmed.

source: དེ་ལ་མྱ་ངན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of nirvāṇa?

source: ཡི་དགས་ཀྱི་འཇིག་རྟེན་ལ་དམིགས་ཤིང་གང་སེམས་ཅན་སྡུག་བསྔལ་བ་མཐོང་ན་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is to observe the world of starving spirits and give to suffering sentient beings when one sees them.

source: དུད་འགྲོའི་གནས་སུ་ཕྱིན་ནས་སེམས་ཅན་སྡུག་བསྔལ་བ་མཐོང་ན་ཡིད་བྱུང་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of entering the realms of animals and being saddened by the sight of suffering sentient beings.

source: དམིགས་པ་མེད་པའི་ཐོས་པ་དང་། རེག་པར་དཀའ་བ་མཐོང་ན་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is acceptance of hearing that which is beyond apprehension and seeing that which is hard to reach.

source: ལོག་པ་སྤོང་བའི་རབ་ཏུ་དབྱེ་བ་ལ་ཡིད་བྱུང་བའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་ཀུན་ལས་བུད་མེད་སྤངས་པ་ལྟ་བུ་གང་ཡིན་པའོ། །
en: Diligence is the intense diligence that demonstrates the relinquishment of errors—for example, dissociating completely from women.

source: ཐར་པ་ལ་དམིགས་པའི་བསམ་གཏན་ནི་དཔེར་ན་ཤིང་འཛམ་བུའི་གྲིབ་མ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration focused on liberation, as exemplified by concentration that resembles the shade of the rose-apple tree.

source: འཁོར་བའི་སྐྱོན་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཤེས་རབ་ནི་དཔེར་ན་རྒྱལ་པོ་རབ་ཏུ་འབྱུང་བའི་ཕྱིར་ཁྱིམ་ནས་བྱུང་བ་དང་། དཔེར་ན་སྤུ་ཟིང་ཞེས་བྱེད་པའི་ཤེས་རབ་ཡོངས་སུ་དཀར་བའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight that quells the flaws of saṃsāra, as exemplified by a king’s stepping forth from the household or the wholesome insight that makes one’s hair stand on end.

source: འདི་དག་ནི་མྱ་ངན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of nirvāṇa.

source: དེ་ལ་དབང་ཆེ་བར་གྲགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the proclamation of great mastery?

source: སྙིང་རྗེ་མེད་པ་མ་ཡིན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving without lacking compassion.

source: ལྷག་པའི་ང་རྒྱལ་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline that is devoid of exaggerating pride.

source: མ་ཞུམ་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is undaunted patience.

source: བླ་མ་ལ་བསྙེན་བཀུར་བྱས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence in serving gurus.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་བསམ་གཏན་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་མེ་ཏོག་ལྟ་བུའི་གང་ཡིན་པའོ། །
en: Concentration is concentration for the sake of ripening sentient beings, as exemplified by Prince Flower.

source: རབ་ཏུ་བྱུང་བ་གང་གི་ཡན་ལག་དང་ཉིང་ལག་གཏུབས་ཀྱང་ནམ་ཡང་ཉམས་པར་མ་གྱུར་པའི་ཤེས་རབ་དོན་དམ་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is insight associated with the ultimate, whereby a renunciant will never become corrupted even if his major and minor body parts are cut off.

source: འདི་དག་ནི་དབང་ཆེ་བར་གྲགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the proclamation of great mastery.

source: དེ་ལ་སྐུལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of encouragement?

source: གང་ལེན་དུ་འཇུག་ཅིང་སྤྲོས་པ་དང་བཅས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is generosity that encourages offering and involves elaboration.

source: ཕན་པའི་དངོས་པོ་དང་ལྡན་ཞིང་ལེགས་པར་སྦྱིན་པ་སྐུལ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the discipline of encouraging fine generosity with helpful things.

source: དུལ་བའི་གནས་སུ་གདམས་ངག་རྗེས་སུ་སྟོན་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is the patience of imparting instructions in a training center.

source: ཆོས་མཉན་པ་དང་བསྒྲགས་པ་ལ་བརྩོན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is diligence with respect to hearing and proclaiming the teachings.

source: སེམས་ཅན་ཡང་དག་པར་ལེན་དུ་འཇུག་པའི་བསམ་གཏན་ནི་དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མིག་བཟངས་ཀྱི་ལྟ་བུ་གང་ཡིན་པའོ། །
en: Concentration is the concentration that causes sentient beings to acquire knowledge, as exemplified by the universal monarch Sunetra.

source: ཐེ་ཙོམ་ཅན་གྱི་ཐེ་ཙོམ་གཅོད་ཅིང་དོར་བར་འདོད་པ་རྣམས་ལ་ཆོས་བསྟན་པའི་ཕྱིར་རྗེས་སུ་བསྲུང་ལ་རབ་ཏུ་འཇོག་པ་བཏང་སྙོམས་ཅན་གྱི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of protective and engaging even-mindedness that aims to eliminate the doubts of those who are unsure and teach the Dharma to those desiring renunciation.

source: འདི་དག་ནི་སྐུལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of encouragement.

source: དེ་ལ་བརྗེད་ངས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of freedom from forgetfulness?

source: ཁ་ཏོན་དང་ལྡན་པ་རྣམས་ལ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is giving to those who recite.

source: དཀོན་མཆོག་གསུམ་ལ་མི་ཕྱེད་པ་ཐོབ་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is discipline that attains inseparability with respect to the Three Jewels.

source: ཐོས་པའི་ཕྱིར་བཟོད་ཅིང་ལུས་ཀྱི་སྡུག་བསྔལ་བཟོད་པ་ནི་དཔེར་ན་བགོ་བ་དེས་པའི་ཡན་ལག་བཅད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is patience for the sake of learning and patience that endures physical pain, as exemplified by Noble Distribution, who had his limbs cut off.

source: མན་ངག་དང་ཁ་ཏོན་བྱ་བའི་བརྩོན་འགྲུས་གཞན་ལ་རྗེས་སུ་བསྲུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the diligence of protecting others through instruction and recitation.

source: བསམ་གཏན་པས་དུས་སུ་ཡང་དག་པར་ལེན་དུ་འཇུག་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration of the meditator who maintains timely practice.

source: རྙེད་པ་དང་། བཀུར་སྟི་ལ་མི་རྟོག་པའི་སྤྱོད་ལམ་ལ་གནས་ནས་ཆོས་སྦྱིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the insight of bestowing the Dharma while maintaining conduct that is unconcerned about wealth or respect.

source: འདི་དག་ནི་བརྗེད་ངས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of freedom from forgetfulness.

source: དེ་ལ་ཞབས་ཤིན་ཏུ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections conducive to feet that stand firm?

source: ཞབས་ས་ལ་འཇོག་པ་ན་སྙོམས་པ་དང་། འདེགས་པ་ན་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the stability of the feet while stepping.

source: བདེ་བར་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as comfortable rest.

source: གཞན་གྱིས་ཉམས་པར་བྱར་མི་ནུས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as other beings’ inability of cause harm.

source: འཁྲུལ་པ་མེད་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as freedom from confusion.

source: ཞབས་རེག་པས་སེམས་ཅན་བདེ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the touch of one’s feet being enjoyable for others.

source: གོ་ཆས་ཇི་ལྟར་འདོད་པ་བཞིན་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as the armor that allows birth in accordance with one’s wishes.

source: འདི་དག་ནི་ཞབས་ཤིན་ཏུ་གནས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections conducive to feet that stand firm.

source: དེ་ལ་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that engender being endowed with the thousand-spoked wheel?

source: འཁོར་ལོས་སྤྲས་པ་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as being adorned with a wheel.

source: རྩིབས་ཕན་ཚུན་མ་འདྲེས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as the spokes that remain distinct from each other.

source: འདོད་ཆགས་ཀྱི་དབང་གིས་མི་གོས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as not being stained by the influence of desire.

source: བུམ་པ་ལྟ་བུ་དང་བཀྲ་ཤིས་དང་། གཡུང་དྲུང་འཁྱིལ་པས་བརྒྱན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as being adorned with a vase design, an auspicious knot, and a swirling swastika.

source: འཁོར་ལོའི་འོད་འབྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as a radiant wheel.

source: འོད་སྣ་ཚོགས་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as shining with various forms of light.

source: འདི་དག་ནི་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་སྒྲུབ་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the thousand-spoked wheel.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་རྟིང་པ་ཡངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as broad heels?

source: རྟིང་པ་ཡངས་ཤིང་ཤིན་ཏུ་སྲབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as one’s heels being broad and perfectly delicate.

source: རྟིང་པ་ཡངས་པ་ཟླུམ་ཞིང་ཤིན་ཏུ་མཁྲེགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as one’s wide heels being round and perfectly firm.

source: རྟིང་པ་ཡངས་ཤིང་ཡོངས་སུ་རྫོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as one’s heels being wide and perfect.

source: རྟིང་པ་ཡངས་ཤིང་སྟབས་ལེགས་པར་བཞུད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as one’s heels being wide with fine movements.

source: རྟིང་པ་ཡངས་ཤིང་མདོག་སྣུམ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as wide heels with a lustrous hue.

source: རྟིང་པ་ཡངས་ཤིང་ལེགས་པར་གྲུབ་ལ་མཁྲང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as wide and well-formed heels free from hardness.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་རྟིང་པ་ཡངས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as broad heels.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as imperceptible anklebones?

source: ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་ཞིང་ཤིན་ཏུ་མཁྲེགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as anklebones being hidden but perfectly hard.

source: ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་པ་ཆུ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as anklebones being hidden and containing fluids.

source: ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་ཞིང་འཇམ་ལ་མདངས་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as anklebones being hidden, smooth, and shining.

source: ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་ཞིང་མཐོན་དམན་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as anklebones being hidden and with an even surface.

source: ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་ཞིང་ཡངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as anklebones being hidden and broad.

source: ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་ཞིང་སྤ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: Insight ripens as anklebones being hidden and concealed.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ཞབས་ལོང་བུའི་ཚིགས་མི་མངོན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as imperceptible anklebones.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་སོར་མོ་རིང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the long fingers?

source: སོར་མོ་རིང་ལ་མི་མཉམ་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as long fingers with equal length.

source: སོར་མོ་རིང་ལ་ཤིན་ཏུ་འབྲེལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as long and beautifully connected fingers.

source: སོར་མོ་རིང་ཞིང་སྣུམ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as long and lustrous fingers.

source: སོར་མོ་རིང་ལ་རིམ་གྱིས་གཞོལ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as long and tapering fingers.

source: སོར་མོ་རིང་ལ་སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as long fingers with copper-colored nails.

source: སོར་མོ་རིང་ལ་ཚིགས་མི་མཐོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as long fingers without any protruding joints.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སོར་མོ་རིང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that ripen as the long fingers.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ཕྱག་དང་ཞབས་དྲ་བ་ཅན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that ripen as the hands and feet being webbed?

source: ཕྱག་དང་ཞབས་དྲ་བ་ཅན་ཚང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as the perfection of the webbed hands and feet.

source: ཤིན་ཏུ་གནས་ཤིང་མཉམ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Discipline ripens as their perfect appropriateness and smoothness.

source: ཕྱག་དང་ཞབས་དྲ་བ་ཅན་མི་རྩུབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Patience ripens as webbed hands and feet that are free from crudeness.

source: ཕྱག་དང་ཞབས་དྲ་བ་ཅན་གསེར་གྱི་མདོག་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: Diligence ripens as webbed hands and feet that are colored like gold.

source: ཕྱག་དང་ཞབས་དྲ་བ་ཅན་ཤིན་ཏུ་མཁྲེགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: Concentration ripens as the tremendous firmness of the webbed hands and feet.
